// Даны два числа. Показать большее и меньшее число
double a=555,b=15;

if(a > b)
{
    Console.WriteLine(a + " является максимальным числом ");
    Console.WriteLine(b + " является минилальным числом ");
} 
else
{
    Console.WriteLine(a + " является минилальным числом ");
    Console.WriteLine(b + " является максимальным числом ");
    
}