// 5. Написать программу вычисления значения функции y=f(a)
double y, f, a;
Console.WriteLine(" введите значение f ");
f = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(" введите значение a ");
a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(y = f*a);


